---
kind: property
id: P:Autodesk.Revit.Exceptions.FunctionId.File
source: html/0ce4abe3-ca5f-2b09-939e-51c17c079524.htm
---
# Autodesk.Revit.Exceptions.FunctionId.File Property

The name of the file including the function throwing an exception.

## Syntax (C#)
```csharp
public string File { get; }
```